app/Models/M_kantor.php

    public function get_all_data()
    {
        return $this->db->table('tbl_kantor')->get()->getResultArray();
---
SELECT *
FROM `tbl_kantor`

    public function detail($id)
    {
        return $this->db->table('tbl_kantor')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `tbl_kantor`
WHERE `id` = '9'